myendless1/xiaopai/stack-chan/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
CONFIG_STACKCHAN_WIFI_SSID="YOUR_WIFI_SSID"
CONFIG_STACKCHAN_WIFI_PASSWORD="YOUR_WIFI_PASSWORD"
CONFIG_STACKCHAN_OTA_URL="http://127.0.0.1:8091/ota"
CONFIG_STACKCHAN_FIRMWARE_OTA_ENABLED=y
CONFIG_STACKCHAN_FIRMWARE_OTA_TIMEOUT_MS=60000
CONFIG_STACKCHAN_RECORD_UPLOAD_URL="http://127.0.0.1:8091/upload-audio"
CONFIG_STACKCHAN_STREAM_TTS_URL="http://127.0.0.1:8091/stream-speak"
CONFIG_STACKCHAN_TTS_URL="http://127.0.0.1:8091/speak?text="
CONFIG_STACKCHAN_TTS_TEXT="Hello, I am Xiaopai"
CONFIG_STACKCHAN_TTS_VOLUME=13
CONFIG_STACKCHAN_TTS_MAX_BYTES=2097152
CONFIG_STACKCHAN_RECORD_SAMPLE_RATE=16000
CONFIG_STACKCHAN_AUDIO_FULL_DUPLEX=y
CONFIG_STACKCHAN_AUDIO_TX_ENABLED=y
# CONFIG_STACKCHAN_AUDIO_DEVICE_AEC is not set
CONFIG_STACKCHAN_AUDIO_HW_SAMPLE_RATE=24000
CONFIG_STACKCHAN_AUDIO_UPSTREAM_SAMPLE_RATE=16000
CONFIG_STACKCHAN_AUDIO_DOWNSTREAM_SAMPLE_RATE=24000
# CONFIG_STACKCHAN_AUDIO_INPUT_REFERENCE is not set
CONFIG_STACKCHAN_AUDIO_INPUT_GAIN=60
CONFIG_STACKCHAN_AUDIO_OUTPUT_VOLUME_DEFAULT=10
CONFIG_CODEC_ES7210_SUPPORT=y
CONFIG_CODEC_AW88298_SUPPORT=y
CONFIG_STACKCHAN_RECORD_CHUNK_MS=40
CONFIG_STACKCHAN_PREROLL_MS=800
CONFIG_STACKCHAN_VOICE_START_THRESHOLD=1500
CONFIG_STACKCHAN_VOICE_STOP_THRESHOLD=800
CONFIG_STACKCHAN_MIC_MAGNIFICATION=1
CONFIG_STACKCHAN_DJI_MIC_USB_INPUT=y
CONFIG_STACKCHAN_DJI_MIC_AUTO_START=y
CONFIG_STACKCHAN_DJI_MIC_DRIVE_VBUS=y
# CONFIG_STACKCHAN_DJI_MIC_LOW_BATTERY_PROTECTION is not set
CONFIG_STACKCHAN_DJI_MIC_START_DELAY_MS=10000
CONFIG_STACKCHAN_DJI_MIC_MAX_START_RETRIES=3
CONFIG_STACKCHAN_DJI_MIC_RETRY_BACKOFF_MS=2000
CONFIG_STACKCHAN_DJI_MIC_ENUM_ONLY=n
CONFIG_STACKCHAN_DJI_MIC_UAC_RECORD=n
CONFIG_STACKCHAN_DJI_MIC_STABLE_MS=800
CONFIG_STACKCHAN_DJI_MIC_VBUS_OFF_MS=800
CONFIG_STACKCHAN_DJI_MIC_HOST_LISTEN_MS=400
CONFIG_STACKCHAN_DJI_MIC_VBUS_SETTLE_MS=2000
CONFIG_STACKCHAN_DJI_MIC_CHANNEL_AUTO_ONCE=y
CONFIG_STACKCHAN_DJI_MIC_DIGITAL_GAIN_PERCENT=100
CONFIG_STACKCHAN_DJI_VOICE_START_THRESHOLD=900
CONFIG_STACKCHAN_DJI_VOICE_STOP_THRESHOLD=400
CONFIG_STACKCHAN_DJI_MIC_UAC_RECORD_RATE=48000
CONFIG_STACKCHAN_DJI_MIC_UAC_RECORD_CHANNELS=2
CONFIG_STACKCHAN_DJI_MIC_UAC_RECORD_BITS=24
CONFIG_STACKCHAN_DJI_MIC_UAC_RECORD_SECONDS=5
CONFIG_STACKCHAN_DJI_MIC_UAC_RINGBUF_BYTES=65536
CONFIG_STACKCHAN_DJI_MIC_UAC_INTERNAL_BUF_BYTES=16384
CONFIG_STACKCHAN_NETWORK_DEBUG=y
CONFIG_STACKCHAN_NETWORK_DEBUG_QUEUE_DEPTH=64
CONFIG_STACKCHAN_NETWORK_DEBUG_BATCH_LINES=8
# CONFIG_STACKCHAN_SERIAL_DEBUG_COMMAND is not set
# ESP_GDBSTUB_ENABLED is hidden and defaults to y in ESP-IDF 5.5. Keep both
# activation paths disabled and omit its optional task-list support.
# CONFIG_ESP_SYSTEM_GDBSTUB_RUNTIME is not set
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# CONFIG_ESP_GDBSTUB_SUPPORT_TASKS is not set
# CONFIG_ESP_DEBUG_OCDAWARE is not set
# CONFIG_FREERTOS_DEBUG_OCDAWARE is not set
CONFIG_STACKCHAN_BATTERY_DJI_START_PERCENT=30
CONFIG_STACKCHAN_BATTERY_LOW_PERCENT=15
CONFIG_STACKCHAN_BATTERY_LOW_MV=3550
CONFIG_STACKCHAN_BATTERY_CRITICAL_MV=3400
CONFIG_STACKCHAN_BATTERY_SAMPLE_MS=1000
CONFIG_STACKCHAN_BATTERY_DEBOUNCE_SAMPLES=5
CONFIG_STACKCHAN_BATTERY_RECOVERY_HYSTERESIS_MV=150
# CONFIG_STACKCHAN_BATTERY_EMERGENCY_POWEROFF is not set
CONFIG_USB_PROC_TASK_STACK_SIZE=8192
CONFIG_STACKCHAN_RECORD_MAX_MS=15000
CONFIG_STACKCHAN_SILENCE_STOP_MS=2500
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=32768
CONFIG_CAMERA_PSRAM_DMA=y
